[
  {
    "id": "2",
    "title": "Front-End Developer",
    "link": "https://zapp-studio.com/",
    "company": "@Zapp Studio",
    "duration": "December 2022 - Present",
    "content": "In my current role, I'm deeply immersed in the development of an agricultural project leveraging Angular 14. Our frontend work revolves around Bootstrap and Ionic, ensuring a seamless user experience. Additionally, I develop user-friendly administration dashboards using Nuxt 2 and Vuetify. These dashboards offer an intuitive interface for user role management, content administration, and client maintenance. <br/><br/> I also develop and maintain applications created with Ionic. This involves ensuring the smooth functioning of the apps, implementing updates as needed, and addressing any user feedback to continuously improve their performance and usability. Each day, I strive to adhere to best practices, with a strong focus on creating code that minimizes cognitive load and remains easily understandable for my colleagues. Documentation is key for me, as I meticulously maintain code documentation and consistently apply new learnings to enhance the product's quality."
  },
  {
    "id": "1",
    "title": "Web Developer",
    "link": "https://www.capgemini.com/es-es/",
    "company": "@Capgemini",
    "duration": "March 2022 - November 2022",
    "content": "I started in Capgemini as an intern, researching about Three.js and 3D development using Angular Three and NgRx. I have been working on a 3D project with animations, physics, collisions and state management. As the application was scaling, I decided to migrated the project from Angular to React to improve the performance with React Three Fiber library, using TypeScript, Redux, Node.js with Express and Mongo DB Atlas. <br/><br/> During this time I tried to document all my code as well as I could. Because of that I created an onboarding Wiki for new employees to make it easy for them to start using the application. I have also worked with Tailwind CSS to style the entire application."
  }
]
